Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ8110CA90144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ADC</name>
         <version>036201a0</version>
         <description>ADC Controller</description>
         <groupName>ADC</groupName>
         <prependToName>ADC_</prependToName>
         <baseAddress>0x46820000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x16C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC_GLOBAL</name>
            <value>185</value>
         </interrupt>
         <interrupt>
            <name>ADC_CORE1</name>
            <value>186</value>
         </interrupt>
         <interrupt>
            <name>ADC_CORE2</name>
            <value>187</value>
         </interrupt>
         <interrupt>
            <name>ADC_CORE3</name>
            <value>188</value>
         </interrupt>
         <interrupt>
            <name>ADC_CORE4</name>
            <value>189</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>CONTROL A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>SOFTWARE RESET BIT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>ENABLE BIT</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANAEN</name>
                     <description>Analog Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIPMPEN</name>
                     <description>Charge Pump Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>CONTROL B REGISTER</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCHSEL</name>
                     <description>Software Trigger Channel Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADCORSEL</name>
                     <description>Software Trigger Core Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RQCNVRT</name>
                     <description>Request Channel Convert</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAMP</name>
                     <description>Channel Sample</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GSWTRG</name>
                     <description>Global Software Trigger</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSWTRG</name>
                     <description>Level Global Trigger</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRGSUSP</name>
                     <description>Trigger Suspend</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWCNVEN</name>
                     <description>Software Conversion Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLC</name>
               <description>Control C Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Clock Divider for Synchronous Trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COREINTERLEAVED</name>
                     <description>Number of Core to Interleave Triggers</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>COREINTERLEAVEDSelect</name>
                        <enumeratedValue>
                           <name>INTERLEAVING_OFF</name>
                           <description>Interleaving Off</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERLEAVING_CORES_0_1</name>
                           <description>Interleaving Cores 0 and 1</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERLEAVING_CORES_1_2</name>
                           <description>Interleaving Cores 1 and 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERLEAVING_CORES_0_1_2</name>
                           <description>Interleaving Cores 0, 1 and 2</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERLEAVING_CORES_1_2_3</name>
                           <description>Interleaving Cores 1, 2 and 3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERLEAVING_CORES_0_1_2_3</name>
                           <description>Interleaving Cores 0, 1, 2 and 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLD</name>
               <description>Control D Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTLCKDIV</name>
                     <description>Control Clock Divider</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CHNEN</name>
                     <description>Digital Channel Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ANLEN</name>
                     <description>Analog Channel Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WKUPEXP</name>
                     <description>Wakeup cycles</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VREFSEL</name>
                     <description>Voltage Reference Select</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>VREFSELSelect</name>
                        <enumeratedValue>
                           <name>AVDD_AVSS</name>
                           <description>AVDD and AVSS</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXTERNAL_VREFH_AVSS</name>
                           <description>External VREFH and AVSS</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>0x20</dimIncrement>
               <name>CONFIG[%s]</name>
               <description/>
               <addressOffset>0x020</addressOffset>
               <register>
                  <name>CORCTRL</name>
                  <description>SARCORE Control</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000C00</resetValue>
                  <fields>
                     <field>
                        <name>SAMC</name>
                        <description>Sample Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                     <field>
                        <name>SELRES</name>
                        <description>Selects Resolution</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SELRESSelect</name>
                           <enumeratedValue>
                              <name>6_BITS</name>
                              <description>6 bits</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>8_BITS</name>
                              <description>8 bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10_BITS</name>
                              <description>10 bits</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>12_BITS</name>
                              <description>12 bits (default)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EIS</name>
                        <description>Early Interrupt Select</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>EIRQOVR</name>
                        <description>Interrupt Type Select</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STRGSRC</name>
                        <description>SCAN trigger source selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>STRGSRCSelect</name>
                           <enumeratedValue>
                              <name>NO_TRIGGER</name>
                              <description>No Trigger (NOP)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_SOFTWARE_TRIGGER</name>
                              <description>Global Software Trigger</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GLOBAL_LEVEL_TRIGGER</name>
                              <description>Global Level Software Trigger</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC_TRIGGER</name>
                              <description>STRIG Synchronous Trigger</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER0</name>
                              <description>ADC Trigger Event User 0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER1</name>
                              <description>ADC Trigger Event User 1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER2</name>
                              <description>ADC Trigger Event User 2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER3</name>
                              <description>ADC Trigger Event User 3</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER4</name>
                              <description>ADC Trigger Event User 4</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER5</name>
                              <description>ADC Trigger Event User 5</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER6</name>
                              <description>ADC Trigger Event User 6</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER7</name>
                              <description>ADC Trigger Event User 7</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER8</name>
                              <description>ADC Trigger Event User 8</description>
                              <value>0xD</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER9</name>
                              <description>ADC Trigger Event User 9</description>
                              <value>0xE</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EVENT_USER10</name>
                              <description>ADC Trigger Event User 10</description>
                              <value>0xF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>STRGLVL</name>
                        <description>Scan Trigger Level Sensitivity</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SCNRTDS</name>
                        <description>SCAN Re-trigger Disable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ADCDIV</name>
                        <description>Division Ratio for SARCORE clock</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHNCFG1</name>
                  <description>Channel Configuration 1 (LVL/CMPEN)</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CHNCMPEN</name>
                        <description>Channel Comparator Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>LVL</name>
                        <description>Channel Level</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHNCFG2</name>
                  <description>Channel Configuration 2(FRACT/CSS)</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CSS</name>
                        <description>Channel SCAN Select</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>FRACT</name>
                        <description>Channel Fractional</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHNCFG3</name>
                  <description>Channel Configuration3 (SIGN/DIFF)</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIFF</name>
                        <description>Differential Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>SIGN</name>
                        <description>SIGN setting</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
